Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/civil_partnerships/civil_partnership_and_social_welfare_entitlements.html.txt.tmx
Source language: en
Languages: ga

source: Civil partnership and social welfare entitlements
ga: Páirtnéireacht shibhialta agus teidlíochtaí leasa shóisialaigh

source: For the purposes of most social welfare claims (for example, Jobseeker's Allowance and Supplementary Welfare Allowance claims) cohabiting couples, people in civil partnerships and married couples are treated the same
ga: Do chuspóirí an chuid is mó d’éilimh leasa shóisialaigh (mar shampla, éilimh Liúntas do Lucht Cuardaigh Fostaíochta and Liúntas Leasa Forlíontach) caitear le lánúineacha comhchónaitheacha, daoine i bpáirtnéireachtaí sibhialta agus lanúineacha pósta mar an gcéanna

source: However, your civil status will affect your entitlement to Widow's, Widower's or Surviving Civil Partner’s (Contributory) Pension or Widow's, Widower's or Surviving Civil Partner’s (Non-Contributory) Pension
ga: Rachaidh do stádas sibhialta i bhfeidhm ar do Phinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) nó do Phinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach), áfach

source: You can only claim Widow's/Widower's/Surviving Civil Partner's Pension if your civil partner dies
ga: Ní féidir leat éileamh a dhéanamh ar Phinsean Baintrí/Baintrí Fir/Páirtnéir Sibhialta Marthanaigh ach amháin má bhásaíonn do pháirtnéir sibhialta

source: You will not be entitled to this pension if you enter into a new civil partnership or marry
ga: Ní bheidh tú i dteideal an phinsin seo má théann tú isteach i bpáirtnéireacht shibhialta nua nó má phósann tú

source: If you are in doubt about how your civil status will affect your claim, you should contact your local social welfare office
ga: Má tá amhras ort faoin gcaoi a chuirfidh do stádas sibhialta isteach ar d’éileamh, ba cheart duit dul i dteagmháil le d’oifig leasa shóisialaigh áitiúil

source: In the case of supplementary welfare allowance, you should contact the Department of Social Protection's representative (formerly known as the Community Welfare Officer) in your local Health Centre or local social welfare office
ga: I gcás liúntas leasa forlíontach, ba cheart duit dul i dteagmháil leis an an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo) i d’Ionad Leighis áitiúil
